"""Константы игры 4096."""

# Размер игрового поля
BOARD_SIZE = 5

# Цель игры
WIN_VALUE = 4096

# Базовые значения плиток
INITIAL_TILES = [2, 4]

# Вероятности появления плиток
PROBABILITY_2 = 0.9  # 90% шанс появления двойки
PROBABILITY_4 = 0.1  # 10% шанс появления четверки

# Управление
UP = "up"
DOWN = "down"
LEFT = "left"
RIGHT = "right"

DIRECTION_KEYS = {
    "w": UP,
    "s": DOWN,
    "a": LEFT,
    "d": RIGHT,
    "ц": UP,
    "ы": DOWN,
    "ф": LEFT,
    "в": RIGHT,
}

USE_COLORS = True

COLORS = {
    0: "\033[90m",    # Серый для пустых
    2: "\033[93m",    # Желтый для 2
    4: "\033[91m",    # Красный для 4
    8: "\033[95m",    # Фиолетовый для 8
    16: "\033[96m",   # Голубой для 16
    32: "\033[92m",   # Зеленый для 32
    64: "\033[94m",   # Синий для 64
    128: "\033[33m",  # Оранжевый для 128
    256: "\033[35m",  # Пурпурный для 256
    512: "\033[36m",  # Бирюзовый для 512
    1024: "\033[31m", # Темно-красный для 1024
    2048: "\033[34m", # Темно-синий для 2048
    4096: "\033[32m", # Темно-зеленый для 4096
    "reset": "\033[0m"
}
